app/Controllers/Auth.php

SELECT *
FROM `admin`
WHERE `phone` = 'admin'
 LIMIT 1
---
    public function auth()
    {
        $session = session();
        $phone    = trim($this->request->getPost('phone'));
        $password = trim($this->request->getPost('password'));

        // Check Admin
        $adminModel = new AdminModel();
        $admin = $adminModel->where('phone', $phone)->first();