app/Controllers/Dashboard.php

    public function index()
    {
        $role   = session('role');
        $userId = session('user_id');
        $today  = date('Y-m-d');

        $data = ['title' => 'Dashboard'];

        // Admin Dashboard
        if ($role == 'admin') {
            $data['totalStudents']  = $this->studentModel->countAll();
            $data['totalParents']   = $this->parentsModel->countAll();
            $data['totalStaff']     = $this->staffsModel->countAll();
            $data['releasedToday']  = $this->fetchLogModel->where('DATE(time_released)', $today)->countAllResults();
            // $data['pendingAuth']    = $this->authLetterModel->where('status', 'pending')->countAllResults(); // <-- Inalis
            $data['smsSentToday']   = $this->smsLogModel->where('DATE(sent_at)', $today)->countAllResults();
            $data['qrReleases']     = $this->fetchLogModel->where('method', 'QR')->countAllResults();
            $data['recentReleases'] = $this->fetchLogModel->orderBy('time_released', 'DESC')->limit(10)->findAll();
            $data['smsLogs'] = $this->smsLogModel->orderBy('sent_at', 'DESC')->limit(10)->findAll();
        }

        // Staff Dashboard
        if ($role == 'staff') {
            $data['totalStudents']     = $this->studentModel->countAll();
            $data['releasedToday']     = $this->fetchLogModel->where('staff_id', $userId)->where('DATE(time_released)', $today)->countAllResults();
            $data['smsSentToday']      = $this->smsLogModel->where('DATE(sent_at)', $today)->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `students`
SELECT COUNT(*) AS `numrows` FROM `parents`
SELECT COUNT(*) AS `numrows` FROM `staffs`
SELECT COUNT(*) AS `numrows`
FROM `fetch_logs`
WHERE DATE(time_released) = '2026-09-01'
SELECT COUNT(*) AS `numrows`
FROM `sms_logs`
WHERE DATE(sent_at) = '2026-09-01'
SELECT COUNT(*) AS `numrows`
FROM `fetch_logs`
WHERE `method` = 'QR'
SELECT `fetch_logs`.*, `students`.`fname` as `sfname`, `students`.`lname` as `slname`, `staffs`.`fname` as `staff_fname`
FROM `fetch_logs`
JOIN `students` ON `students`.`id` = `fetch_logs`.`student_id`
LEFT JOIN `staffs` ON `staffs`.`id` = `fetch_logs`.`staff_id`
ORDER BY `time_released` DESC
 LIMIT 10
SELECT *
FROM `sms_logs`
ORDER BY `sent_at` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `sms_logs`
WHERE DATE(sent_at) = '2026-06-03'


        // Parent Dashboard
        if ($role == 'parent') {
            $data['parentProfile'] = $this->parentsModel->find($userId);

            $db = \Config\Database::connect();
            $studentParents = $db->table('student_parents')
                ->where('parent_id', $userId)
                ->get()
                ->getResultArray();
---
SELECT *
FROM `parents`
WHERE `parents`.`id` = '46'
SELECT *
FROM `student_parents`
WHERE `parent_id` = '46'

            $data['myChildren'] = [];
            if (!empty($studentParents)) {
                foreach ($studentParents as $sp) {
                    $student = $this->studentModel->find($sp['student_id']);
---
SELECT *
FROM `students`
WHERE `students`.`id` = '46'

                $data['myChildren'] = $this->studentModel->where('parent_id', $userId)->findAll();
            }

            $data['subFetchers'] = $this->subFetcherModel->where('parent_id', $userId)->findAll();
---
SELECT *
FROM `sub_fetchers`
WHERE `parent_id` = '46'