app/Controllers/Dashboard.php

SELECT `fetch_logs`.`student_id`, `fetch_logs`.`fetcher_fname`, `fetch_logs`.`fetcher_lname`, `fetch_logs`.`fetcher_relation`, `fetch_logs`.`method`, `fetch_logs`.`time_released`, `students`.`fname` AS `student_fname`, `students`.`lname` AS `student_lname`, `students`.`grade_section`, `parents`.`fname` AS `parent_fname`, `parents`.`lname` AS `parent_lname`
FROM `fetch_logs`
LEFT JOIN `students` ON `students`.`id` = `fetch_logs`.`student_id`
LEFT JOIN `parents` ON `parents`.`id` = `fetch_logs`.`parent_id`
ORDER BY `fetch_logs`.`time_released` DESC
 LIMIT 10
---
    public function index()
    {
        $role   = session('role');
        $userId = session('user_id');
        $today  = date('Y-m-d');

        $data = ['title' => 'Dashboard'];

        // Admin Dashboard
        if ($role == 'admin') {
            $data['totalStudents']  = $this->studentModel->countAll();
            $data['totalParents']   = $this->parentsModel->countAll();
            $data['totalStaff']     = $this->staffsModel->countAll();
            $data['releasedToday']  = $this->fetchLogModel->where('DATE(time_released)', $today)->countAllResults();
            // $data['pendingAuth']    = $this->authLetterModel->where('status', 'pending')->countAllResults(); // <-- Inalis
            $data['smsSentToday']   = $this->smsLogModel->where('DATE(sent_at)', $today)->countAllResults();
            $data['qrReleases']     = $this->fetchLogModel->where('method', 'QR')->countAllResults();

            $db = \Config\Database::connect();
            $data['recentReleases'] = $db->table('fetch_logs')
                ->select('fetch_logs.student_id, fetch_logs.fetcher_fname, fetch_logs.fetcher_lname, fetch_logs.fetcher_relation, fetch_logs.method, fetch_logs.time_released, students.fname AS student_fname, students.lname AS student_lname, students.grade_section, parents.fname AS parent_fname, parents.lname AS parent_lname')
                ->join('students', 'students.id = fetch_logs.student_id', 'left')
                ->join('parents', 'parents.id = fetch_logs.parent_id', 'left')
                ->orderBy('fetch_logs.time_released', 'DESC')
                ->limit(10)
                ->get()
                ->getResultArray();