app/Controllers/Messages.php

            $with = (int) $this->request->getGet('with');
            if ($with > 0) {
                $data['selected_id']   = $with;
                $data['selected']      = $db->table('parents')->where('id', $with)->get()->getRowArray();
---
SELECT *
FROM `parents`
WHERE `id` = 47

    public function unread()
    {
        if (!session('logged_in')) {
            return $this->response->setJSON(['count' => 0]);
        }

        $role = session('role');
        $me   = (int) session('user_id');
        $db   = \Config\Database::connect();

        if ($role == 'parent') {
            $count = $db->table('messages')->where('receiver_id', $me)->where('is_read', 0)->countAllResults();
        } elseif ($role == 'teacher') {
            $count = 0;
        } else {
            $count = $db->table('messages')->where('sender_role', 'parent')->where('is_read', 0)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `sender_role` = 'parent'
AND `is_read` = 0

    private function threadForParent($db, int $pid): array
    {
        return $db->table('messages')
            ->where("(sender_role = 'parent' AND sender_id = {$pid}) OR receiver_id = {$pid}")
            ->orderBy('created_at', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `messages`
WHERE (`sender_role` = 'parent' AND `sender_id` = 47) OR `receiver_id` = 47
ORDER BY `created_at` ASC

    private function markParentRead($db, int $pid): void
    {
        $db->table('messages')
            ->where('sender_role', 'parent')
            ->where('sender_id', $pid)
            ->where('is_read', 0)
            ->update(['is_read' => 1]);
---
UPDATE `messages` SET `is_read` = 1
WHERE `sender_role` = 'parent'
AND `sender_id` = 47
AND `is_read` = 0

    private function officeThreads($db): array
    {
        $parents = $db->table('messages')
            ->select('sender_id')
            ->distinct()
            ->where('sender_role', 'parent')
            ->get()
            ->getResultArray();

        $threads = [];
        foreach ($parents as $p) {
            $pid = (int) $p['sender_id'];
            $parent = $db->table('parents')->where('id', $pid)->get()->getRowArray();
            if (!$parent) {
                continue;
            }

            $last = $db->table('messages')
                ->where("(sender_role = 'parent' AND sender_id = {$pid}) OR receiver_id = {$pid}")
                ->orderBy('created_at', 'DESC')
                ->limit(1)
                ->get()
                ->getRowArray();

            $unread = $db->table('messages')
                ->where('sender_role', 'parent')
                ->where('sender_id', $pid)
                ->where('is_read', 0)
                ->countAllResults();
---
SELECT DISTINCT `sender_id`
FROM `messages`
WHERE `sender_role` = 'parent'
SELECT *
FROM `parents`
WHERE `id` = 1
SELECT *
FROM `messages`
WHERE (`sender_role` = 'parent' AND `sender_id` = 1) OR `receiver_id` = 1
ORDER BY `created_at` DESC
 LIMIT 1
SELECT COUNT(*) AS `numrows`
FROM `messages`
WHERE `sender_role` = 'parent'
AND `sender_id` = 1
AND `is_read` = 0