app/Controllers/Parents.php

    public function index()
    {
        $model = new ParentsModel();
        $db = \Config\Database::connect();

        // Get parents with their linked students
        $data['parents'] = $db->table('parents')
            ->select('parents.*, students.fname as student_fname, students.lname as student_lname, students.grade_section as student_grade, student_parents.relation')
            ->join('student_parents', 'student_parents.parent_id = parents.id', 'left')
            ->join('students', 'students.id = student_parents.student_id', 'left')
            ->orderBy('parents.created_at', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `parents`.*, `students`.`fname` as `student_fname`, `students`.`lname` as `student_lname`, `students`.`grade_section` as `student_grade`, `student_parents`.`relation`
FROM `parents`
LEFT JOIN `student_parents` ON `student_parents`.`parent_id` = `parents`.`id`
LEFT JOIN `students` ON `students`.`id` = `student_parents`.`student_id`
ORDER BY `parents`.`created_at` DESC

    public function view($id)
    {
        $model = new ParentsModel();
        $data['parent'] = $model->find($id);
        if (!$data['parent']) {
            return redirect()->to('/parents')->with('error', 'Parent not found');
        }

        // Get linked students via student_parents table
        $db = \Config\Database::connect();

        $data['students'] = $db->table('student_parents')
            ->select('student_parents.*, students.fname, students.mname, students.lname, students.grade_section, students.picture, students.id as student_id')
            ->join('students', 'students.id = student_parents.student_id')
            ->where('student_parents.parent_id', $id)
            ->get()
            ->getResultArray();

        // Get sub-fetchers
        $subFetcherModel = new SubFetcherModel();
        $data['subFetchers'] = $subFetcherModel->where('parent_id', $id)->findAll();
---
SELECT *
FROM `parents`
WHERE `parents`.`id` = '29'
SELECT *
FROM `parents`
ORDER BY `created_at` DESC
SELECT `student_parents`.*, `students`.`fname`, `students`.`mname`, `students`.`lname`, `students`.`grade_section`, `students`.`picture`, `students`.`id` as `student_id`
FROM `student_parents`
JOIN `students` ON `students`.`id` = `student_parents`.`student_id`
WHERE `student_parents`.`parent_id` = '29'
SELECT *
FROM `sub_fetchers`
WHERE `parent_id` = '29'

    public function logs()
    {
        $userId = session('user_id');
        $studentModel = new \App\Models\StudentModel();
        $subFetcherModel = new SubFetcherModel();

        $db = \Config\Database::connect();
        $studentParents = $db->table('student_parents')
            ->where('parent_id', $userId)
            ->get()
            ->getResultArray();

        $studentIds = [];
        foreach ($studentParents as $sp) {
            $studentIds[] = $sp['student_id'];
        }

        $oldStudents = $studentModel->where('parent_id', $userId)->findAll();
        foreach ($oldStudents as $s) {
            $studentIds[] = $s['id'];
        }

        $subFetchers = $subFetcherModel->where('parent_id', $userId)->findAll();
---
SELECT *
FROM `student_parents`
WHERE `parent_id` = '38'
SELECT *
FROM `sub_fetchers`
WHERE `parent_id` = '38'

        if (!empty($studentIds)) {
            $studentIds = array_unique($studentIds);
            $fetchLogModel = new \App\Models\FetchLogModel();
            $releases = $fetchLogModel
                ->whereIn('student_id', $studentIds)
                ->orderBy('time_released', 'DESC')
                ->limit(50)
                ->findAll();
---
SELECT *
FROM `fetch_logs`
WHERE `student_id` IN ('38')
ORDER BY `time_released` DESC
 LIMIT 50