app/Controllers/ScanMonitor.php

SELECT COUNT(*) AS `numrows`
FROM `fetch_logs`
WHERE DATE(time_released) = '2026-06-09'
SELECT COUNT(*) AS `numrows`
FROM `activity_logs`
WHERE DATE(created_at) = '2026-06-09'
AND `action` = 'decline'
AND `module` = 'scan'
SELECT COUNT(*) AS `numrows`
FROM `students`
SELECT COUNT(*) AS `numrows`
FROM `fetch_logs`
WHERE DATE(time_released) = '2026-08-14'
SELECT COUNT(*) AS `numrows`
FROM `activity_logs`
WHERE DATE(created_at) = '2026-06-09'
AND `module` = 'scan'
SELECT `fetch_logs`.*, `students`.`fname` as `student_fname`, `students`.`lname` as `student_lname`, `students`.`grade_section`
FROM `fetch_logs`
LEFT JOIN `students` ON `students`.`id` = `fetch_logs`.`student_id`
WHERE DATE(fetch_logs.time_released) = '2026-06-09'
ORDER BY `fetch_logs`.`time_released` DESC
 LIMIT 20
SELECT *
FROM `activity_logs`
WHERE DATE(created_at) = '2026-06-09'
AND `module` = 'scan'
ORDER BY `created_at` DESC
 LIMIT 30
SELECT `student_id`
FROM `fetch_logs`
WHERE DATE(time_released) = '2026-06-09'
---
    public function index()
    {
         if (!session('logged_in')) {
            return redirect()->to('/login')->send();
        }
        $db = \Config\Database::connect();
        $today = date('Y-m-d');

        // Stats
        $data['releasedToday'] = $db->table('fetch_logs')
            ->where('DATE(time_released)', $today)
            ->countAllResults();

        $data['declinedToday'] = $db->table('activity_logs')
            ->where('DATE(created_at)', $today)
            ->where('action', 'decline')
            ->where('module', 'scan')
            ->countAllResults();

        $data['pendingRelease'] = $db->table('students')
            ->countAllResults() - $data['releasedToday'];

        $data['totalScans'] = $db->table('activity_logs')
            ->where('DATE(created_at)', $today)
            ->where('module', 'scan')
            ->countAllResults();

        // Recent releases today
        $data['recentReleases'] = $db->table('fetch_logs')
            ->select('fetch_logs.*, students.fname as student_fname, students.lname as student_lname, students.grade_section')
            ->join('students', 'students.id = fetch_logs.student_id', 'left')
            ->where('DATE(fetch_logs.time_released)', $today)
            ->orderBy('fetch_logs.time_released', 'DESC')
            ->limit(20)
            ->get()
            ->getResultArray();

        // Scan activities today
        $data['scanActivities'] = $db->table('activity_logs')
            ->where('DATE(created_at)', $today)
            ->where('module', 'scan')
            ->orderBy('created_at', 'DESC')
            ->limit(30)
            ->get()
            ->getResultArray();

        // Students still inside (not released today)
        $releasedStudentIds = $db->table('fetch_logs')
            ->select('student_id')
            ->where('DATE(time_released)', $today)
            ->get()
            ->getResultArray();

SELECT `students`.*, `parents`.`fname` as `parent_fname`, `parents`.`lname` as `parent_lname`
FROM `students`
LEFT JOIN `parents` ON `parents`.`id` = `students`.`parent_id`
WHERE `students`.`id` NOT IN ('27','27','27','27','27','27','27','27','16','16')
ORDER BY `students`.`grade_section` ASC
SELECT `students`.*, `parents`.`fname` as `parent_fname`, `parents`.`lname` as `parent_lname`
FROM `students`
LEFT JOIN `parents` ON `parents`.`id` = `students`.`parent_id`
ORDER BY `students`.`grade_section` ASC
---
        $releasedIds = array_column($releasedStudentIds, 'student_id');

        if (!empty($releasedIds)) {
            $data['studentsInside'] = $db->table('students')
                ->select('students.*, parents.fname as parent_fname, parents.lname as parent_lname')
                ->join('parents', 'parents.id = students.parent_id', 'left')
                ->whereNotIn('students.id', $releasedIds)
                ->orderBy('students.grade_section', 'ASC')
                ->get()
                ->getResultArray();
        } else {
            $data['studentsInside'] = $db->table('students')
                ->select('students.*, parents.fname as parent_fname, parents.lname as parent_lname')
                ->join('parents', 'parents.id = students.parent_id', 'left')
                ->orderBy('students.grade_section', 'ASC')
                ->get()
                ->getResultArray();