app/Controllers/ScanMonitor.php


        // Count pending students (not released)
        if (!empty($releasedIds)) {
            $data['pendingCount'] = $db->table('students')
                ->whereNotIn('id', $releasedIds)
                ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `students`
WHERE `id` NOT IN ('46')

            $data['declinedStudents'][] = $d;
        }

        // ===== GET ALL GRADES FOR FILTER =====
        $data['grades'] = $db->table('students')
            ->select('grade_section')
            ->distinct()
            ->orderBy('grade_section', 'ASC')
            ->get()
            ->getResultArray();

        // ===== ACTIVITY LOGS (Merged) =====
        $releases = $db->table('fetch_logs')
            ->select('fetch_logs.*, students.fname as student_fname, students.lname as student_lname, students.grade_section')
            ->join('students', 'students.id = fetch_logs.student_id', 'left')
            ->where('DATE(fetch_logs.time_released)', $selectedDate)
            ->orderBy('fetch_logs.time_released', 'DESC')
            ->limit(100)
            ->get()
            ->getResultArray();
---
SELECT DISTINCT `grade_section`
FROM `students`
ORDER BY `grade_section` ASC
SELECT `fetch_logs`.*, `students`.`fname` as `student_fname`, `students`.`lname` as `student_lname`, `students`.`grade_section`
FROM `fetch_logs`
LEFT JOIN `students` ON `students`.`id` = `fetch_logs`.`student_id`
WHERE DATE(fetch_logs.time_released) = '2026-08-14'
ORDER BY `fetch_logs`.`time_released` DESC
 LIMIT 100

            }
        }

        $declines = $db->table('activity_logs')
            ->select('activity_logs.*')
            ->where('DATE(activity_logs.created_at)', $selectedDate)
            ->where('action', 'decline')
            ->where('module', 'scan')
            ->orderBy('activity_logs.created_at', 'DESC')
            ->limit(100)
            ->get()
            ->getResultArray();
---
SELECT `activity_logs`.*
FROM `activity_logs`
WHERE DATE(activity_logs.created_at) = '2026-08-14'
AND `action` = 'decline'
AND `module` = 'scan'
ORDER BY `activity_logs`.`created_at` DESC
 LIMIT 100