app/Controllers/Scan.php

    public function verify()
    {
        $qrCode = $this->request->getPost('qr_code');

        if (empty($qrCode)) {
            return $this->response->setJSON(['success' => false, 'message' => 'QR code is required']);
        }

        $parentsModel = new ParentsModel();
        $subFetcherModel = new SubFetcherModel();

        $parent = $parentsModel->where('qr_code', $qrCode)->first();
        $fetcher = null;
        $parentId = null;

        if ($parent) {
            $parentId = $parent['id'];
            $fetcher = [
                'type' => 'Main Parent',
                'fname' => $parent['fname'],
                'lname' => $parent['lname'],
                'phone' => $parent['phone'],
                'picture' => $parent['picture'] ?? null,
            ];
        } else {
            $subFetcher = $subFetcherModel->where('qr_code', $qrCode)->first();
            if ($subFetcher) {
                $parentId = $subFetcher['parent_id'];
                $parent = $parentsModel->find($parentId);
---
SELECT *
FROM `parents`
WHERE `qr_code` = 'QR-651C429EE571'
SELECT *
FROM `sub_fetchers`
WHERE `qr_code` = 'QR-651C429EE571'
SELECT *
FROM `parents`
WHERE `id` = '13'

        }

        $db = \Config\Database::connect();
        $students = $db->table('student_parents')
            ->select('student_parents.student_id, students.fname, students.lname, students.grade_section, students.picture')
            ->join('students', 'students.id = student_parents.student_id')
            ->where('student_parents.parent_id', $parentId)
            ->get()
            ->getResultArray();
---
SELECT `students`.*, `student_parents`.`relation`
FROM `student_parents`
JOIN `students` ON `students`.`id` = `student_parents`.`student_id`
WHERE `student_parents`.`parent_id` = '13'