app/Controllers/Sms.php

SELECT *
FROM `sms_logs`
ORDER BY `sent_at` DESC
 LIMIT 200
SELECT COUNT(*) AS `numrows`
FROM `sms_logs`
---
    public function index()
    {
        $db = \Config\Database::connect();

        // ===== GET SMS LOGS ONLY (No grouping) =====
        $data['smsLogs'] = $db->table('sms_logs')
            ->orderBy('sent_at', 'DESC')
            ->limit(200)
            ->get()
            ->getResultArray();

        // Get stats
        $data['totalSms'] = $db->table('sms_logs')->countAllResults();