app/Controllers/Staffs.php

SELECT *
FROM `staffs`
ORDER BY `created_at` DESC
---
    public function index()
    {
        if (!session('logged_in')) {
            return redirect()->to('/login')->send();
        }

        $model = new StaffsModel();
        $data['staffs'] = $model->orderBy('created_at', 'DESC')->findAll();