app/Controllers/Students.php

SELECT *
FROM `students`
ORDER BY `created_at` DESC
---
    public function index()
    {
        $data['students'] = $this->studentModel->orderBy('created_at', 'DESC')->findAll();