app/Controllers/Teachers.php

    public function index()
    {
        if (session('role') != 'admin' && session('role') != 'staff') {
            return redirect()->to('/dashboard');
        }
        $model = new TeachersModel();
        $teachers = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `teachers`
ORDER BY `created_at` DESC

    private function gradeSections()
    {
        $db = \Config\Database::connect();
        $fromStudents = $db->table('students')->distinct()->select('grade_section')->get()->getResultArray();
        $fromTeachers = $db->table('teachers')->distinct()->select('grade_section')->get()->getResultArray();
---
SELECT DISTINCT `grade_section`
FROM `students`
SELECT DISTINCT `grade_section`
FROM `teachers`