app/Models/ActivityLogModel.php

    public function addLog($userId, $userName, $role, $action, $module, $description = '')
    {
        return $this->insert([
            'user_id'     => $userId,
            'user_name'   => $userName,
            'role'        => $role,
            'action'      => $action,
            'module'      => $module,
            'description' => $description,
            'ip_address'  => $_SERVER['REMOTE_ADDR'] ?? null,
        ]);
---
INSERT INTO `activity_logs` (`user_id`, `user_name`, `role`, `action`, `module`, `description`, `ip_address`) VALUES ('1', 'Admin ', 'admin', 'login', 'auth', 'Admin logged in | Phone: admin', '::1')

    public function getLogs($filter = 'all', $module = '', $date = '', $limit = 200)
    {
        $builder = $this->orderBy('created_at', 'DESC');

        if ($filter == 'today') {
            $builder->where('DATE(created_at)', date('Y-m-d'));
        } elseif ($filter == 'week') {
            $builder->where('created_at >=', date('Y-m-d', strtotime('-7 days')));
        } elseif ($filter == 'month') {
            $builder->where('created_at >=', date('Y-m-d', strtotime('-30 days')));
        }

        if ($module) {
            $builder->where('module', $module);
        }

        if ($date) {
            $builder->where('DATE(created_at)', $date);
        }

        return $builder->limit($limit)->findAll();
---
SELECT *
FROM `activity_logs`
WHERE DATE(created_at) = '2026-08-04'
AND DATE(created_at) = '2026-08-04'
ORDER BY `created_at` DESC
 LIMIT 200