app/Models/SmsLogModel.php

SELECT *
FROM `sms_logs`
ORDER BY `sent_at` DESC
 LIMIT 200
---
    public function getAll($limit = 200)
    {
        return $this->orderBy('sent_at', 'DESC')
                    ->limit($limit)
                    ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `sms_logs`
WHERE `status` = 'sent'
---
    public function getFailedCount()
    {
        return $this->where('status', 'failed')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `sms_logs`
WHERE DATE(sent_at) = '2026-06-09'
---
    public function getTodayCount()
    {
        $today = date('Y-m-d');
        return $this->where('DATE(sent_at)', $today)->countAllResults();