app/Models/StudentModel.php

SELECT `students`.*, `parents`.`fname` as `pfname`, `parents`.`lname` as `plname`, `parents`.`phone` as `pphone`
FROM `students`
LEFT JOIN `parents` ON `parents`.`id` = `students`.`parent_id`
ORDER BY `students`.`created_at` DESC
---
    public function getAllWithParent()
    {
        return $this->select('students.*, parents.fname as pfname, parents.lname as plname, parents.phone as pphone')
                    ->join('parents', 'parents.id = students.parent_id', 'left')
                    ->orderBy('students.created_at', 'DESC')
                    ->findAll();