app/Models/TeachersModel.php

SELECT `grade_section`, COUNT(*) as total
FROM `students`
GROUP BY `grade_section`
---
    public function studentCounts(): array
    {
        $db = \Config\Database::connect();
        return $db->table('students')
            ->select('grade_section, COUNT(*) as total')
            ->groupBy('grade_section')
            ->get()
            ->getResultArray();